[
  {
    "name": "Google Drive",
    "description": "Use Google Drive within Slack to:• Create new Google Docs, Slides, and Sheets files• Import an existing file from Google Drive into a channel or direct message• Search directly within Google Drive files shared within Slack• Automatically grant access to the files you share with the right audience• Get updates in Slack on changes in Drive, like comments, access requests, and new files shared with you• Reply directly to comment notifications from within Slack and have them posted to the file"
  },
  {
    "name": "Zoom",
    "description": "Start Zoom Meetings and make Zoom Phone calls with flawless video, crystal clear audio, and instant screen sharing from any Slack channel, private group, or direct message using the /zoom slash command.The Zoom app for Slack can be installed individually by any Slack user with a Zoom account or be deployed to the whole organization centrally by the Zoom account admin with a few simple steps."
  },
  {
    "name": "Google Calendar",
    "description": "From viewing your daily schedule or receiving up-to-the-minute reminders, keep your calendar top of mind without leaving Slack. Use Google Calendar in Slack to:• Create an event right from Slack using the shortcuts button.• Automatically sync your calendar to your Slack status to let your team know when you are in a meeting.• See a holistic view of your daily schedule from Slack.• Get notified when an event is starting soon, and join a Hangout, Zoom, Webex, or Microsoft Teams meeting directly from the calendar reminder in Slack.• Respond directly to event invitations.• Get updated when an event’s details change, and change your response as needed.Here are some details to bear in mind about status sync:• Your status will not include the name of the meeting that you’re attending.• You can remove or update your Slack status at any time – the Google Calendar app won’t override any status that you’ve set yourself.• Only events that you accept will trigger a status update in Slack.• Slack will only sync with the primary calendar for the Google account that you’ve connected.• If there are overlapping events on your calendar, Slack will set your status to match the event that’s longer or that starts earlier."
  },
  {
    "name": "Outlook Calendar",
    "description": "Let your team know when you're busy and keep your calendar top of mind with up-to-date reminders in Slack. Available for Office 365 Outlook Calendar.Use Outlook Calendar in Slack to:• Create an event right from Slack using the shortcuts button.• Automatically sync your calendar to your Slack status to let your team know when you are in a meeting, out of the office, or working from home.• See a holistic view of your daily schedule from Slack.• Get notified when an event is starting soon, and join a Hangout, Zoom, Webex, or Microsoft Teams meeting directly from the calendar reminder in Slack.• RSVP directly to event invitations, get updated when an event’s details change, and change your response as needed.Here are some details to bear in mind about status sync:• Your status will not include the name of the meeting that you’re attending.• You can remove or update your Slack status at any time – the Outlook Calendar app won’t override any status that you’ve set yourself.• Only events that you accept will trigger a status update in Slack.• Slack will only sync with the primary calendar for the Outlook account that you’ve connected.• If there are overlapping events on your calendar, Slack will set your status to match the event that’s longer or that starts earlier.Notes:• Outlook Calendar for Slack is only available for Office 365. The app is not supported for on-premise Microsoft Exchange customers.• On-premise SharePoint installations or Office 365 plans hosted on a Microsoft national cloud deployment (including Office 365 U.S. Government, Office 365 Germany, and Office 365 operated by 21Vianet in China) are not supported.This app is subject to the Slack integration terms & conditions."
  },
  {
    "name": "OneDrive and SharePoint",
    "description": "Search, share and preview your OneDrive or SharePoint Online files right from Slack. Then automatically adjust permissions so the right team members have the right access.Share files without leaving SlackNo need to open a new tab to hunt down a link to a file — it’s easy to search for documents and share them right from Slack. Start by clicking the :paperclip: paperclip button on the right side of the message field, or visit the OneDrive and SharePoint app’s home tab in Slack. Preview docs, presentations, and moreWhen you share a file link in Slack, the OneDrive and SharePoint app will add a rich preview of the document, so you and your team can easily gather context before opening the file.Share with the right peopleThe OneDrive and SharePoint app checks when you share a file to make sure everyone in the conversation has access and automatically offers to update the link for you if they don’t.Install the app and share a OneDrive or SharePoint Online link to get started!"
  },
  {
    "name": "Dropbox",
    "description": "Connect to the Dropbox and Slack integration and begin to:- Share Dropbox content to Slack channels or in direct messages, right from Dropbox.- Start Slack conversations about your work from Dropbox.- See your Dropbox file previews right within your Slack conversations.- Keep track of where work has been shared in Slack from file activity feeds in Dropbox."
  },
  {
    "name": "Slack for Gmail",
    "description": "Keep conversations moving forward by bringing context from an email into a Slack channel or direct message with the Slack for Gmail Add-On available in the G Suite Marketplace. You can choose to add a message and include attachments along with the email as well.When to send email into Slack:• Email chain getting too noisy? Send it into Slack where you can discuss quickly and move forward.• Have an idea you want to share with your team? Send it along to a relevant channel with a note about your insights.• Need to coordinate a response to a customer question? Flag your teammates in Slack and use the email content to set context.How the Add-On works:• Start by installing the Slack for Gmail Add-On from the G Suite Marketplace• Open any email and click on the Slack icon in the right-hand side of your inbox • Choose the channel or person you’d like to forward the email to inside of Slack• Add a message and include attachments if you’d like• Voilà! The email is forwarded into Slack where anyone in the channel or direct message you shared it to can see the email content and open attachments.Please note that the following limits apply to emails shared via this app:• The combined headers and body of an email cannot be larger than 1MB.• When combined with attachments, an email cannot be larger than 30 MB.• There is a maximum of 20 attachments per email."
  },
  {
    "name": "Box File Picker",
    "description": "Box helps business of all sizes in every industry securely collaborate and manage their content in the cloud.This integration will import Box files into Slack. Imported files are searchable and shareable in Slack but will continue to be stored in your Box account. Imported files will be automatically updated when the corresponding Box file is updated.To import files from your Box account, use the Add File button in Slack (it’s beside the message input), or just include a shared link to the file in a message."
  },
  {
    "name": "Box",
    "description": "Box for Slack helps businesses of all sizes securely manage and collaborate on content to drive more productive teamwork. Easily access your Box content from within Slack to share or import files and eliminate time-consuming context switching between applications. Your content remains centralized in Box, but quickly available where collaboration happens in Slack. End-user features:• Content cards: View file information such as name, author, thumbnail and more when a Box file is shared to Slack• Instant permissions: Update the collaboration permissions of a Box file directly from within Slack• Box slash commands: Quickly perform common actions such as searching for files in Box and viewing recent files within Slack• Box content picker: Securely share content from Box in channels and direct messages without leaving conversations. Install the Box content picker here.Admin features:• Enable/disable document thumbnails: Choose whether file thumbnails are displayed for shared Box files• Enable/disable permission checks before file display: Choose whether content cards are shown based on Box file permissions• Enable/disable Slack indexing: Choose whether the contents of shared Box files are indexed and surfaced in Slack's native search• Slack whitelisting: Set specific Slack workspaces or Enterprise Grid orgs that can be connected to your Box enterprise instanceNote: This app can only be used by paid Box business accounts with admin consoles. Admin settings can be customized from within the Box Admin Console. Please visit the Box Community site for more information."
  },
  {
    "name": "Slack for Outlook",
    "description": "Keep conversations moving forward by bringing context from an email into a Slack channel or direct message with the Slack for Outlook Add-In available in the Microsoft AppSource. You can choose to add a message and include attachments along with the email as well.When to send email into Slack:• Email chain getting too noisy? Send it into Slack where you can discuss quickly and move forward.• Have an idea you want to share with your team? Send it along to a relevant channel with a note about your insights.• Need to coordinate a response to a customer question? Flag your teammates in Slack and use the email content to set context.How the Add-On works:• Start by installing the Slack for Outlook Add-In from the Microsoft AppSource.• Open any email and click on the slack icon in the right-hand side of your inbox. • Choose the channel or person you’d like to forward the email to inside of Slack.• Add a message and include attachments if you’d like.• Voilà! The email is forwarded into Slack where anyone in the channel or direct message. you shared it to can see the email content and open attachments.Compatibility:• Slack for Outlook works with most versions of Outlook that allow add-ins for Office: Outlook Web App and Office 2016 for Windows, Mac, iOS, and Android.• You must have a Slack account and an Office 365 Commercial subscription to use this add-in. On-premises Exchange Server is not supported.Please note that the following limits apply to emails shared via this app:• The combined headers and body of an email cannot be larger than 1MB.• When combined with attachments, an email cannot be larger than 30 MB.• There is a maximum of 20 attachments per email."
  },
  {
    "name": "BlueJeans",
    "description": "Easily start, join, and invite anyone to a BlueJeans Meeting from any Slack channel, group or direct message using the /bluejeans slash commands. Automatically post meeting summaries and highlights to private Slack channels to share key takeaways and actions. Use a free trial or paid BlueJeans account to get started. Contact developers at support@bluejeans.com"
  },
  {
    "name": "Centro: Email, SMS, & Salesforce",
    "description": "Centro brings order to chaos with our suite of advanced productivity tools. Integrate to Salesforce in ways you never thought possible. Move faster with email and SMS automation. Never miss the most important part of a conversation with Grok summarization powered by GPT-3. :partly_sunny: Advanced Salesforce integration and automation:mage:Grok Channel Summaries - Get up to speed fast:robot_face: Email and SMS automations within Slack:e-mail: Shared inbox in Slack:sparkles: Link Slack channels and threads for discovering and learning in SalesforceUsing Centro will speed up the productivity of your team - here’s some use cases that our customers are fired up about:- Create Salesforce Cases in a Slack Connect Channel using a customized form- Create a draft escalation email for the team to collaborate on- Respond to new Leads faster than ever as a team- Learn and discover how a team closed a deal- Create implementation channels for project teams with the context they need- Send a quote for manager approval, approve in seconds with a custom button- Make Slack your Salesforce user-interface for complex or simple no-code automations with combined power of Salesforce Flow and Slack Workflow BuilderWhat will you build with Centro today?Centro offers a free 14-day free trial."
  },
  {
    "name": "Google Sheets for Workflow Builder",
    "description": "From effortlessly adding information to a spreadsheet, to searching for specific data, save time by automating the tedious work of keeping spreadsheets up-to-date.Workflow Builder is a no-code tool that helps automate routine tasks right in Slack, and now you can seamlessly connect your workflows to a Google Sheet. Whether you’re sending new information to a spreadsheet or pulling data into Slack, let Workflow Builder handle the context-switching, so you can stay focused and save time.Use workflow steps from this app to:• Add a spreadsheet row• Select a spreadsheet row• Update a spreadsheet row• Delete a spreadsheet rowIn order to use this app, your Google account must be able to access Google Drive with the Drive SDK API."
  }
]